tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "docker"
brew "gh"
brew "git"
brew "gnupg"
brwe "mas" # App Store application Search
brew "pinentry-mac"
brew "pipenv"
brew "pyenv"
brew "smimesign"
brew "tig"
brew "yamllint"

cask "appcleaner"
# cask "aws-vault"
cask "caffeine"
# cask "chromium"
cask "clipy"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "KeyboardCleanTool"
cask "slack"
cask "spectacle"
cask "visual-studio-code"
cask "zoom"

# App Store applications
# $ mas search <アプリ名>
mas "1Password", id: 443987910
# mas "Bitwarden", id: 1352778147
# mas "LINE", id: 539883307
