# 
# $brew bundle dump
# 

tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"


## Homebrew
brew "bat"
brew "direnv"
brew "docker"
brew "gh"            # GitHub CLI
brew "git"
brew "gnupg"
brwe "mas"           # App Store application Search
brew "pgformatter"   
brew "pinentry-mac"
brew "pipenv"
brew "postgresql@14", restart_service: true
brew "pyenv"
# brew "python@3.11"
brew "ripgrep"
brew "smimesign"
brew "tig"           # GitHub command like a $git graph
brew "yamllint"
brew "hashicorp/tap/terraform"

cask "appcleaner"
# cask "aws-vault"
cask "caffeine"
# cask "chromium"
cask "clipy"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "KeyboardCleanTool"
cask "slack"
cask "spectacle"
cask "visual-studio-code"
cask "zoom"


## App Store applications
#  if you do not know application id number that you shoud try berow command.
#  $ mas search <ApplicationName>
mas "1Password", id: 443987910
# mas "Bitwarden", id: 1352778147
# mas "LINE", id: 539883307
