# -----------------------------
# 🍻 $ brew bundle dump
#    -> Brewfile
# -----------------------------

# Tap

tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Brew

brew "autoconf"
brew "automake"
brew "bash-preexec"
brew "bat"           # $ bat extention $cat
brew "bottom"        # $ btm
brew "cue"
brew "direnv"
brew "docker"
brew "dust"
brew "eza"           # $ eza extention $ls
brew "gcc"
brew "gh"            # $ gh GitHub CLI
brew "git"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "hugo"
brew "jq"
brew "make"
brew "mas"           # App Store application Search
brew "ncurses"
brew "nodebrew"
brew "pgformatter"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "postgresql@14", restart_service: true
brew "pyenv"
# brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "smimesign"
brew "stow"          # GNU Stow is dotfiles manager
brew "tig"           # GitHub command like a `$git graph`
brew "tree"
brew "virtualenv"
brew "xdg-ninja"
brew "yamllint"
brew "zplug"
brew "hashicorp/tap/terraform"

# Cask

cask "appcleaner"
# cask "aws-vault"
cask "caffeine"
# cask "chromium"                # Browser
cask "clipy"
cask "dexed"                     #
cask "docker"
# cask "font-hackgen"
# cask "font-hackgen-nerd"
cask "font-monaspace-nerd-font"
cask "google-chrome"             # Browser
cask "google-cloud-sdk"
# cask "HuggingChat"             # AI
# cask "iterm2"                  # Terminal
cask "KeyboardCleanTool"
# cask "pulsar"                  # IED
cask "slack"
cask "spectacle"
# cask "visual-studio-code"      # IDE
cask "wezterm"                   # Terminal
# cask "zoom"


# -----------------------------
# 🍏 $ mas search <ApplicationName>
# if you do not know application id number that you shoud try berow command.
# -----------------------------
# mas "1Password", id: 443987910
mas "Bitwarden", id: 1352778147
# mas "LINE", id: 539883307
