# -----------------------------
# 🍻 $ brew bundle dump
#    -> Brewfile
# -----------------------------

# Tap

tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"


# Brew

brew "autoconf"
brew "automake"
brew "bash-preexec"
brew "bat"           # $ bat extention $cat
brew "bottom"        # $ btm
brew "direnv"
brew "docker"
brew "dust"
brew "eza"           # $ eza extention $ls
brew "gcc"
brew "gh"            # $ gh GitHub CLI
brew "git"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "jq"
brwe "mas"           # App Store application Search
brew "ncurses"
brew "pgformatter"
brew "pinentry-mac"
brew "pipenv"
brew "postgresql@14", restart_service: true
brew "pyenv"
# brew "python@3.11"
brew "python@3.12"
brew "virtualenv"
brew "ripgrep"
brew "smimesign"
brew "tig"           # GitHub command like a $git graph
brew "tree"
brew "yamllint"
brew "zplug"
brew "hashicorp/tap/terraform"


# Cask

cask "appcleaner"
# cask "aws-vault"
cask "caffeine"
# cask "chromium"
cask "clipy"
cask "dexed"
cask "docker"
# cask "font-monaspace-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "KeyboardCleanTool"
cask "pulsar"
cask "slack"
cask "spectacle"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"


# -----------------------------
# 🍏 $ mas search <ApplicationName>
# if you do not know application id number that you shoud try berow command.
# -----------------------------
mas "1Password", id: 443987910
# mas "Bitwarden", id: 1352778147
# mas "LINE", id: 539883307
